leon2/system/blockMeshDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 500;

vertices
(
    (-1 0 -1)
    (1 0 -1)
    (1  1.8 -1)
    (-1  1.8 -1)
    (-1 0 1)
    (1 0 1)
    (1  1.8 1)
    (-1  1.8 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 70 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upperWall    
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
